src/cf/InformationRegisters/РегистрацияЗемельныхУчастков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияЗемельныхУчастков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВключатьВНалоговуюБазу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКатегорииЗемель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастроваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСобственность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляВПравеОбщейСобственностиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляВПравеОбщейСобственностиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилищноеСтроительство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПравНаОбъектНедвижимости</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостановкаНаУчетВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПостановкаНаУчетВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Comment>Код налогового органа (по месту регистрации имущества)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацияВИФНС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>ОКАТО объекта ОС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяЛьготаПоНалоговойБазе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидНалоговойЛьготыПоНалоговойБазеПоЗемельномуНалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УменьшениеНалоговойБазыПоСтатье391</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УменьшениеНалоговойБазыНаСумму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОблагаемаяНалогомСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяЛьготаПоСуммеНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидНалоговойЛьготыПоСуммеНалогаПоЗемельномуНалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СниженнаяНалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентУменьшенияСуммыНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУменьшенияСуммыНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляНеОблагаемойНалогомПлощадиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляНеОблагаемойНалогомПлощадиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидЗаписиОРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПостановкаНаУчетВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ПостановкаНаУчетВНалоговомОргане</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоМестуНахожденияОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДругимКодомПоОКАТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВДругомНалоговомОргане</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидНалоговойЛьготыПоНалоговойБазеПоЗемельномуНалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидНалоговойЛьготыПоНалоговойБазеПоЗемельномуНалогу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПрименяется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсвобождениеОтНалогообложенияМестное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсвобождениеОтНалогообложенияПоСтатье395</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаемаяНалогомПлощадь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшениеНалоговойБазы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидНалоговойЛьготыПоСуммеНалогаПоЗемельномуНалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидНалоговойЛьготыПоСуммеНалогаПоЗемельномуНалогу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПрименяется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СниженнаяНалоговаяСтавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшениеСуммыНалогаВПроцентах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшениеСуммыНалогаНаСумму</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/РегистрацияВИФНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>РегистрацияВИФНС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Comment>Представитель в территориальном органе ФНС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителя</Name>
					<Comment>Название документа, подтверждающего полномочия представителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УполномоченноеЛицоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/РегистрацияЗемельныхУчастков/Forms/Регистрация/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьВидимость()
	Элементы.ДоляВПравеОбщейСобственностиЧислитель.Доступность               = Запись.ОбщаяСобственность;
	Элементы.ДоляВПравеОбщейСобственностиЧислитель.АвтоОтметкаНезаполненного = Запись.ОбщаяСобственность;
	Элементы.ДоляВПравеОбщейСобственностиЧислитель.ОтметкаНезаполненного     = Запись.ОбщаяСобственность И Запись.ДоляВПравеОбщейСобственностиЧислитель = 0;
	
	Элементы.ДоляВПравеОбщейСобственностиЗнаменатель.Доступность               = Запись.ОбщаяСобственность;
	Элементы.ДоляВПравеОбщейСобственностиЗнаменатель.АвтоОтметкаНезаполненного = Запись.ОбщаяСобственность;
	Элементы.ДоляВПравеОбщейСобственностиЗнаменатель.ОтметкаНезаполненного     = Запись.ОбщаяСобственность И Запись.ДоляВПравеОбщейСобственностиЗнаменатель = 0;
	
	Элементы.ДатаНачалаПроектирования.Доступность                = Запись.ЖилищноеСтроительство;
	Элементы.ДатаРегистрацииПравНаОбъектНедвижимости.Доступность = Запись.ЖилищноеСтроительство;
	
	//Запись.ПостановкаНаУчетСДругимКодомПоОКАТО=(Запись.ПостановкаНаУчетВНалоговомОргане=ПредопределенноеЗначение("Перечисление.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО"));
	
	//Элементы.КодПоОКАТОПоМестуНахожденияОрганизации.Доступность               = Запись.ПостановкаНаУчетСДругимКодомПоОКАТО;
	//Элементы.КодПоОКАТОПоМестуНахожденияОрганизации.АвтоОтметкаНезаполненного = Запись.ПостановкаНаУчетСДругимКодомПоОКАТО;
	//Элементы.КодПоОКАТОПоМестуНахожденияОрганизации.ОтметкаНезаполненного     = Запись.ПостановкаНаУчетСДругимКодомПоОКАТО И ПустаяСтрока(КодПоОКАТОПоМестуНахожденияОрганизации);
	//
	//Элементы.КодПоОКТМОПоМестуНахожденияОрганизации.Доступность               = Запись.ПостановкаНаУчетСДругимКодомПоОКАТО;
	//Элементы.КодПоОКТМОПоМестуНахожденияОрганизации.АвтоОтметкаНезаполненного = Запись.ПостановкаНаУчетСДругимКодомПоОКАТО;
	//Элементы.КодПоОКТМОПоМестуНахожденияОрганизации.ОтметкаНезаполненного     = Запись.ПостановкаНаУчетСДругимКодомПоОКАТО И ПустаяСтрока(КодПоОКТМОПоМестуНахожденияОрганизации);
	
	//ПостановкаНаУчетВДругомНалоговомОргане = (Запись.ПостановкаНаУчетВНалоговомОргане=ПредопределенноеЗначение("Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане"));
	
	//Элементы.НалоговыйОрган.Доступность               = ПостановкаНаУчетВДругомНалоговомОргане;
	//Элементы.НалоговыйОрган.АвтоОтметкаНезаполненного = ПостановкаНаУчетВДругомНалоговомОргане;
	//Элементы.НалоговыйОрган.ОтметкаНезаполненного     = ПостановкаНаУчетВДругомНалоговомОргане И НалоговыйОрган.Пустая();
	
	//Элементы.НадписьКодПоОКАТО.Доступность = ПостановкаНаУчетВДругомНалоговомОргане;
	
	//Элементы.КодПоОКАТОВДругомНалоговомОргане.Доступность               = ПостановкаНаУчетВДругомНалоговомОргане;
	//Элементы.КодПоОКАТОВДругомНалоговомОргане.АвтоОтметкаНезаполненного = ПостановкаНаУчетВДругомНалоговомОргане;
	//Элементы.КодПоОКАТОВДругомНалоговомОргане.ОтметкаНезаполненного     = ПостановкаНаУчетВДругомНалоговомОргане И ПустаяСтрока(КодПоОКАТОВДругомНалоговомОргане);
	//
	//Элементы.КодПоОКТМОВДругомНалоговомОргане.Доступность               = ПостановкаНаУчетВДругомНалоговомОргане;
	//Элементы.КодПоОКТМОВДругомНалоговомОргане.АвтоОтметкаНезаполненного = ПостановкаНаУчетВДругомНалоговомОргане;
	//Элементы.КодПоОКТМОВДругомНалоговомОргане.ОтметкаНезаполненного     = ПостановкаНаУчетВДругомНалоговомОргане И ПустаяСтрока(КодПоОКТМОВДругомНалоговомОргане);

	//Элементы.НалоговаяЛьгота.Заголовок=УправлениеВнеоборотнымиАктивами.ПредставлениеНалоговойЛьготыПоЗемельномуНалогу(РегистрСведенийМенеджерЗаписи);
																	   
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаСервере
Процедура ОсновноеСредствоПриИзменении()
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ОсновноеСредство", Запись.ОсновноеСредство);
	Запрос.УстановитьПараметр("Организация",      Запись.Организация);
	Запрос.УстановитьПараметр("Период",           Запись.Период);
	Запрос.Текст="
	|ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&Период, Организация = &Организация И ОсновноеСредство = &ОсновноеСредство) КАК ИсточникДанных
	|";
	Выборка=Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		// Код по ОКАТО.
		Если Запись.ПостановкаНаУчетВНалоговомОргане = Перечисления.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО Тогда
			КодПоОКАТОПоМестуНахожденияОрганизации = Запись.КодПоОКАТО;
			КодПоОКТМОПоМестуНахожденияОрганизации = Запись.КодПоОКТМО;
		ИначеЕсли Запись.ПостановкаНаУчетВНалоговомОргане = Перечисления.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане Тогда
			КодПоОКАТОВДругомНалоговомОргане = Запись.КодПоОКАТО;
			КодПоОКТМОВДругомНалоговомОргане = Запись.КодПоОКТМО;
		КонецЕсли;
	КонецЕсли;
		
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура НалоговаяЛьготаНажатие(Элемент)
	ОткрытьФорму("РегистрСведений.РегистрацияЗемельныхУчастков.Форма.ФормаНастройкиЛьготы",,ЭтаФорма,УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыборКода(ИмяКода, НазваниеМакета)
	ПараметрыФормы=Новый Структура;
	ПараметрыФормы.Вставить("ТипОбъекта",      "РегистрСведений");
	ПараметрыФормы.Вставить("НазваниеОбъекта", "РегистрацияЗемельныхУчастков");
	ПараметрыФормы.Вставить("НазваниеМакета",  НазваниеМакета);
	ПараметрыФормы.Вставить("ТекущийПериод",   Запись.Период);
	ПараметрыФормы.Вставить("ТекущийКод",      Запись[ИмяКода]);
	
	ДополнительныеПараметры=Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКода", ИмяКода);
	
	ОповещениеОЗакрытии=Новый ОписаниеОповещения("ВыборКодаЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы,,,,,ОповещениеОЗакрытии);	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКодаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	ИмяКода = ДополнительныеПараметры.ИмяКода;
	ВыбранныйКод = РезультатЗакрытия;
	Если ВыбранныйКод <> Неопределено Тогда
		Модифицированность = Истина;
		Запись[ИмяКода] = ВыбранныйКод;
	КонецЕсли;	
	//*** УправлениеФормой(ЭтаФорма);	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ОсновноеСредство" Тогда
		ОсновноеСредствоПриИзменении();
		
	ИначеЕсли Элемент.Имя="ОбщаяСобственность" Тогда
		 УстановитьВидимость();
		 
	ИначеЕсли Элемент.Имя="ЖилищноеСтроительство" Тогда
		 УстановитьВидимость();
		 
	ИначеЕсли Элемент.Имя="ПостановкаНаУчетВНалоговомОргане" Тогда
		 УстановитьВидимость();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.Имя="КодКатегорииЗемель" Тогда
		СтандартнаяОбработка=Ложь;
		ВыборКода("КодКатегорииЗемель", "КатегорииЗемельныхУчастков");

	ИначеЕсли Элемент.Имя="НалоговыйОрган" Тогда
		СтандартнаяОбработка=Ложь;
		
		СтруктураОтбора=Новый Структура;
		СтруктураОтбора.Вставить("Организация", Запись.Организация);
		
		ПараметрыФормы=Новый Структура;
		ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
		
		ОткрытьФорму("Справочник.РегистрацияВИФНС.ФормаСписка",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Элемент.Имя="КБК" Тогда
		СтандартнаяОбработка=Ложь;
		ВыборКода("КБК", "КБК");
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОрганизацияПоУмолчанию = УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");	
	Если ЭтаФорма.Параметры.ЗначениеКопирования.Пустой() Тогда
		Если Запись.Организация.Пустая() Тогда
			Запись.Организация=ОрганизацияПоУмолчанию;
		КонецЕсли;
		
		Запись.ПостановкаНаУчетВНалоговомОргане = ПредопределенноеЗначение("Перечисление.ПостановкаНаУчетВНалоговомОргане.ПоМестуНахожденияОрганизации");
		Запись.НалоговаяЛьготаПоНалоговойБазе   = ПредопределенноеЗначение("Перечисление.ВидНалоговойЛьготыПоНалоговойБазеПоЗемельномуНалогу.НеПрименяется");
		Запись.НалоговаяЛьготаПоСуммеНалога     = ПредопределенноеЗначение("Перечисление.ВидНалоговойЛьготыПоСуммеНалогаПоЗемельномуНалогу.НеПрименяется");
	КонецЕсли;
	
	// Код по ОКАТО.
	Если Запись.ПостановкаНаУчетВНалоговомОргане = ПредопределенноеЗначение("Перечисление.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО") Тогда
		КодПоОКАТОПоМестуНахожденияОрганизации = Запись.КодПоОКАТО;
		КодПоОКТМОПоМестуНахожденияОрганизации = Запись.КодПоОКТМО;
	ИначеЕсли Запись.ПостановкаНаУчетВНалоговомОргане = ПредопределенноеЗначение("Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане") Тогда
		КодПоОКАТОВДругомНалоговомОргане = Запись.КодПоОКАТО;
		КодПоОКТМОВДругомНалоговомОргане = Запись.КодПоОКТМО;
	КонецЕсли;
	
	УстановитьВидимость();	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Запись.Период = Дата(1,1,1) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата регистрации!",,,, Отказ);
	КонецЕсли;
	
	Если Запись.Организация.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана организация!",,,, Отказ);
	КонецЕсли;
	
	Если Запись.ОсновноеСредство.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано основное средство!",,,, Отказ);
	КонецЕсли;
	
	Если ПустаяСтрока(Запись.КодКатегорииЗемель) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан код категории земель!",,,, Отказ);
	КонецЕсли;
	
	Если Запись.КадастроваяСтоимость = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана кадастровая стоимость!",,,, Отказ);
	КонецЕсли;
	
	Если Запись.ОбщаяСобственность Тогда
		Если Запись.ДоляВПравеОбщейСобственностиЧислитель = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан числитель дроби - доли в праве на участок!",,,, Отказ);
		КонецЕсли;
		
		Если Запись.ДоляВПравеОбщейСобственностиЗнаменатель = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан знаменатель дроби - доли в праве на участок!",,,, Отказ);
		КонецЕсли;
		
		Если НЕ Запись.ДоляВПравеОбщейСобственностиЧислитель = 0
			И НЕ Запись.ДоляВПравеОбщейСобственностиЗнаменатель = 0
			И Запись.ДоляВПравеОбщейСобственностиЧислитель > Запись.ДоляВПравеОбщейСобственностиЗнаменатель Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Доля в праве на участок: числитель дроби больше знаменателя!",,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Запись.ПостановкаНаУчетВНалоговомОргане=Перечисления.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО Тогда
		Если ПустаяСтрока(КодПоОКТМОПоМестуНахожденияОрганизации) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан код по ОКТМО!",,,, Отказ);
		КонецЕсли;

		Если ПустаяСтрока(КодПоОКАТОПоМестуНахожденияОрганизации) И Год(Запись.Период) < 2014 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан код по ОКАТО!",,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Запись.ПостановкаНаУчетВНалоговомОргане=Перечисления.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане Тогда
		Если Запись.НалоговыйОрган.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан налоговый орган!",,,, Отказ);
		КонецЕсли;
		
		Если ПустаяСтрока(КодПоОКТМОВДругомНалоговомОргане) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан код по ОКТМО!",,,, Отказ);
		КонецЕсли;

		Если ПустаяСтрока(КодПоОКАТОВДругомНалоговомОргане) И Год(Запись.Период) < 2014 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан код по ОКАТО!",,,, Отказ);
		КонецЕсли;		
	КонецЕсли;
	
	Если ПустаяСтрока(Запись.КБК) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан КБК!",,,, Отказ);
	КонецЕсли;
	
	Если Запись.НалоговаяСтавка = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана налоговая ставка!",,,, Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Запрос=Новый Запрос;
		Запрос.УстановитьПараметр("Период",           Запись.Период);
		Запрос.УстановитьПараметр("Организация",      Запись.Организация);
		Запрос.УстановитьПараметр("ОсновноеСредство", Запись.ОсновноеСредство);
		Запрос.Текст="
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(РегистрацияЗемельныхУчастков.ВидЗаписи) КАК ВидЗаписи
		|ИЗ
		|	РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
		|ГДЕ
		|	РегистрацияЗемельныхУчастков.Период = &Период
		|	И РегистрацияЗемельныхУчастков.Организация = &Организация
		|	И РегистрацияЗемельныхУчастков.ОсновноеСредство = &ОсновноеСредство
		|";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Формат(Запись.Период, "ДФ=dd.MM.yyyy") + " по основному средству <" + СокрЛП(Запись.ОсновноеСредство) + "> 
			                                         |уже есть запись <" + Выборка.ВидЗаписи + "> в организации <" + СокрЛП(Запись.Организация) + ">!",,,, Отказ);
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда // Код по ОКАТО.
		Если Запись.ПостановкаНаУчетВНалоговомОргане = Перечисления.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО Тогда
			Запись.КодПоОКАТО = КодПоОКАТОПоМестуНахожденияОрганизации;
			Запись.КодПоОКТМО = КодПоОКТМОПоМестуНахожденияОрганизации;
		ИначеЕсли Запись.ПостановкаНаУчетВНалоговомОргане = Перечисления.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане Тогда
			Запись.КодПоОКАТО = КодПоОКАТОВДругомНалоговомОргане;
			Запись.КодПоОКТМО = КодПоОКТМОВДругомНалоговомОргане;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Информация не записана.",,,, Отказ);
	КонецЕсли;
КонецПроцедуры
